[
    {
      "faqtitle": "Before Applying",
      "faqitems": [
        {
          "itemtitle": "Why should I work for you?",
          "itemparas": [
            {
              "para": "Our team's core values are central to our success; we work in a friendly and supportive environment where communication and collaboration is encouraged. We respect and listen to each other and take pride in working together to achieve our goals. We value all employee contributions, regardless of the level of seniority. We are passionate about providing learning opportunities for all staff, at all levels, as we see the value of investing in team members professional development. We understand the importance of having a work life balance and strive to help our employees find a happy medium. We establish relationships based on trust and work hard to maintain an open and honest work environment."
            }
          ]
        },
        {
          "itemtitle": "What is your company culture?",
          "itemparas": [
            {
              "para": "Our company culture is centred around drive and development. Our team members are constantly striving to better themselves by learning new skills and developing new services for our clients, in order to provide the best possible outcomes."
            },
            {
              "para": "Within the team we have a good mix of employees with varying experience - from office apprentices to clinicians with over 20 years of experience. Those with plenty of experience are able to mentor junior team members and all experience new challenges in the development of new services. Everyone is very supportive and happy to help each other out. Please see our culture section to find out more."
            }
          ]
        },
        {
          "itemtitle": "Why should I work for you, over the NHS?",
          "itemparas": [
            {
              "para": "Our clinically trained employees tell us that two of the most rewarding benefits of working privately are having access to state of the art resources to offer to our clients and having the luxury of being able to spend more time with patients, allowing optimal intensity of therapy and the best possible outcomes. We are proud to be able to offer the newest advanced evidence based treatments and most innovative technology to our clients without experiencing the restrictions many in the NHS do. We have access to FES, saebo, hoisted treadmills, large gym spaces, hydrotherapy and offer specialised intensive CIMT programmes."
            }
          ]
        },
        {
          "itemtitle": "What can you offer to junior staff?",
          "itemparas": [
            {
              "para": "We offer a supportive and encouraging environment for learning. As a junior member of the team, you will be assigned a supervisor who will mentor you as you develop and gain confidence in your abilities."
            }
          ]
        },
        {
          "itemtitle": "What can you offer to senior staff?",
          "itemparas": [
            {
              "para": "We respect that you have gained valuable experience in previous employment roles and value the expertise that you bring with you to our company. We have a collaborative approach and encourage transparency and openness. We offer a competitive salary and flexibility where other employers may not be able to."
            }
          ]
        },
        {
          "itemtitle": "How do salaries, bonuses and pay reviews work?",
          "itemparas": [
            {
              "para": "The starting salary for each position varies, depending on the level of experience and or qualifications required."
            },
            {
              "para": "Each graduate position within the company has a fixed starting salary, specific to the role. We regularly review salaries during appraisals and expect to make adjustments as employees take on additional responsibilities and add more value to the company."
            },
            {
              "para": "In addition to basic salaries, all team members are rewarded with a performance based bonus twice annually."
            }
          ]
        },
        {
          "itemtitle": "What employee benefits are on offer?",
          "itemparas": [
            {
              "para": "Our employees work in a friendly and social environment with a warm and open atmosphere in our offices. We offer a competitive salary, a supportive learning environment and many opportunities for development. Many of our offices and clinics are in central locations which are easily accessible. We also regularly organise social activities for staff members, which take place in the evenings and weekends and are attended by many."
            }
          ]
        }
      ]
    },
    {
      "faqtitle": "The Application Process",
      "faqitems": [
        {
          "itemtitle": "How do I apply for a role? ",
          "itemparas": [
            {
              "para": "The best way to apply would be directly through our website, where a  list of our current vacancies are available. To apply for any of the positions listed, please complete the online form and attach a copy of your CV to your application. We also routinely advertise vacancies on a number of external job sites; in these circumstances please follow the application instructions given by the job site."
            }
          ]
        },
        {
          "itemtitle": "What is the application process?",
          "itemparas": [
            {
              "para": "The process begins with submitting an application form which can be done either online, via email or by post. Whichever way you choose to apply, we will send a confirmation notification within two working days. If the role advertised has a closing date for applications, we will shortlist following this date, or if no date is listed, we may shortlist a number of weeks following your application. After shortlisting, we invite candidates for interview. This is done primarily over the phone but occasionally over email. Depending on the role, we may invite candidates back for a second interview prior to making a decision. We will do our best to inform you of our final decision within two weeks of your interview date."
            },
            {
              "para": "We advise applicants to regularly review their inboxes including 'spam' folders and to turn on and regularly check their phone and voicemail facilities."
            }
          ]
        },
        {
          "itemtitle": "What should I expect at the interview?",
          "itemparas": [
            {
              "para": "Our interview questions are themed around the core competencies detailed in the job specification and job description of the advertised role you apply for. In the majority of cases, the interview process will consist of two rounds of interviews before a final decision is made."
            },
            {
              "para": "The first interview is designed for us to discover your understanding of the role you are applying to and the work you believe the role will entail. We aim to get to know a little about you and to discover what motivates you. We will also ask about your past experiences and may test your technical by asking you to complete a number of short online tests to assess your verbal and numerical reasoning skills."
            },
            {
              "para": "The second interview often involves more senior member of the team who is tasked with differentiating between the best candidates from the initial round of interviews. This interview may involve more in depth and technical questions and you may be asked to give a short presentation or demonstrate your skills."
            }
          ]
        },
        {
          "itemtitle": "I'm not available to attend an interview - is there an alternative option?",
          "itemparas": [
            {
              "para": "We much prefer to meet candidates in person however we accept that there are some circumstances which might make physical attendance at an interview difficult. In these circumstances, we are willing to interview candidates through skype, facetime or whatsapp."
            }
          ]
        },
        {
          "itemtitle": "Do I have to apply online?",
          "itemparas": [
            {
              "para": "We strongly advise that you apply online, however you do not have to. If you apply by post, we will scan and process your application online for you."
            }
          ]
        },
        {
          "itemtitle": "How can I get my CV to stand out?",
          "itemparas": [
            {
              "para": "As we are sure you can appreciate, our HR team receives a large number of CVs. We advise that you have a clear and concise CV that is no longer than two sides in length. The layout of your CV gives us an indication about you and how you organise information and highlight important details within a limited space. We like to see a CV that is easy to decipher and of course factually correct, without any typos or grammatical errors. It is good practice to include a short cover letter with some additional information about yourself and why you are interested in"
            }
          ]
        },
        {
          "itemtitle": "Should I include a cover letter?",
          "itemparas": [
            {
              "para": "A cover letter is a great opportunity to provide us with additional information about yourself and to explain why you would like to work with us. It is an extra chance for you to ensure your application stands from the others. We recommend that you submit both your CV and cover letter in a PDF format to allow us to view it in the way you would like it to be seen, without being distorted if opened on different devices to your own."
            }
          ]
        },
        {
          "itemtitle": "Will I receive feedback on my application?",
          "itemparas": [
            {
              "para": "Whilst we are appreciative of the time you have set aside to submit your application to us, due to the high number of submissions we receive, we do not have the resources within our team to be provide feedback to every applicant. Should you progress to the stage where you are interviewed by us, we would be happy to provide feedback at this point."
            }
          ]
        },
        {
          "itemtitle": "How do I contact you about my application?",
          "itemparas": [
            {
              "para": "If you need to get in touch for any reason, please contact us either via email at careers@physio.co.uk or call 0330 088 7800. Please note that correspondence from us may be redirected to your spam folder, so it is worth checking here before getting in touch with us.the position you have applied for."
            }
          ]
        },
        {
          "itemtitle": "Do you accept speculative applications?",
          "itemparas": [
            {
              "para": "We are more than happy to receive applications for positions that may not be advertised at the moment. We will keep a record of your details and when a position we feel you may be interested does come up, we will get in touch to let you know about it."
            }
          ]
        },
        {
          "itemtitle": "Who has access to my details after I apply?",
          "itemparas": [
            {
              "para": "Our team involved in shortlisting are the only members of staff who will have access to your details when you submit your application. We store candidate details on a central database and they will remain here for three years to enable us to review profiles of those interested should we have another position become relevant in the future. If you would prefer for us to remove your details, you can contact us in writing to request that they are deleted."
            }
          ]
        }
      ]
    }
]
